bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
// Copyright 2020-2026 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <common/bk_include.h>
#include "sys_hal.h"
#include "sys_ll.h"
#include "sys_ahbp_ll.h"
#include "sys_aonp_struct.h"
#include "aon_pmu_hal.h"
#include "gpio_hal_v2px.h"
#include "gpio_driver_base.h"
#include "sys_types.h"
#include <driver/aon_rtc.h>
#include <driver/hal/hal_spi_types.h>
#include <driver/hal/hal_qspi_types.h>
#include <gpio_driver.h>
#include "timer_hal.h"
#include <driver/pwr_clk.h>
#include "bk_misc.h"
#include "cpu_id.h"

#define PM_CLKSEL_CORE_320M                 (2)
#define PM_CLKSEL_CORE_480M                 (3)
#define PM_CLKSEL_FLASH_480M                (0x1)
#define PM_CLKDIV_CORE_0                    (0)
#define PM_CLKDIV_CORE_1                    (1)
#define PM_VDDD_H_VOL_1V                    (0x6)
#define PM_VDDDIG_H_VOL_0V85                (0x6) //0.7+0.025*0x6=0.85v
#define PM_VDDDIG_H_VOL_0v9                 (0x8) //0.7+0.025*0x8=0.9v
#define PM_VDDDIG_H_VOL_0V95                (0xA) //0.7+0.025*0xA=0.95v
#define PM_AP_VDDDIG_REG_VALUE_TO_VOLT(value) ((value) * 0.025f + 0.7f)
#define PM_CLKDV_CPU1_1                     (0x1)
#define PM_CLKDV_CPU0_0                     (0x0)
#define SYS_SWITCH_VDDDIG_VOL_DELAY_TIME    (10)

#define SYS_PM_HAL_CPU_BARRIER()             do { \
	__asm__ volatile ("dsb");                     \
	__asm__ volatile ("isb");                     \
} while (0)

typedef struct {
	pm_cpu_freq_e freq;
	uint32_t cksel_core;
	uint32_t ckdiv_core;
	uint32_t ckdiv_bus;
	uint32_t ckdiv_cpu0;
	uint32_t ckdiv_cpu1;
	uint32_t vdddig_vol;
} sys_hal_cpu_bus_freq_cfg_t;

static const sys_hal_cpu_bus_freq_cfg_t s_cpu_bus_freq_cfg[] = {
#if CONFIG_DCO_CLK_ENABLE
	{PM_CPU_FRQ_XTAL, 0x3, 0x0, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
	{PM_CPU_FRQ_80M,  0x3, 0x2, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
	{PM_CPU_FRQ_120M, 0x3, 0x1, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
#else
	{PM_CPU_FRQ_XTAL, 0x3, 0x0, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
	{PM_CPU_FRQ_80M,  0x0, 0x1, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
	{PM_CPU_FRQ_120M, 0x1, 0x3, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
#endif
	{PM_CPU_FRQ_160M, 0x1, 0x2, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
	{PM_CPU_FRQ_240M, 0x1, 0x1, 0x0, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
	{PM_CPU_FRQ_320M, 0x2, 0x1, 0x1, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
	{PM_CPU_FRQ_480M, 0x1, 0x0, 0x1, 0x0, 0x0, PM_VDDDIG_H_VOL_0V95},
};

static sys_hal_t s_sys_hal;
// static pm_cpu_freq_e s_pre_cpu_freq = PM_CPU_FRQ_120M;
uint32 sys_hal_get_int_group2_status(uint32_t core_id);
bk_err_t sys_hal_ctrl_vddd_h_vol(uint32_t vol_value);
bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value);
uint32_t sys_hal_vdddig_h_vol_get();
static void sys_hal_delay(volatile uint32_t times);
extern void rtos_setup_systick(uint32_t cpu_clock_hz);

bk_err_t sys_hal_init()
{
	s_sys_hal.hw = (sys_hw_t *)SYS_LL_REG_BASE;
	return BK_OK;
}

void sys_hal_usb_enable_clk(bool en)
{
	return;
}

void sys_hal_usb_analog_phy_en(bool en)
{
	return;
}

void sys_hal_set_ana_reg_spi_latch1v(uint32_t v)
{
	sys_ll_set_ana_reg10_spi_latch1v(v);
}

void sys_hal_set_ioldo_bypass(uint32_t v)
{
	return;
}

void sys_hal_set_ioldo_volt(uint32_t v)
{
	return;
}

void sys_hal_flash_set_clk(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_flash(value);
}

void sys_hal_flash_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_ckdiv_flash(value);
}

uint32_t sys_hal_flash_get_clk_sel(void)
{
	return sys_ll_get_cpu_clk_div_mode1_cksel_flash();
}

uint32_t sys_hal_flash_get_clk_div(void)
{
	return sys_ll_get_cpu_clk_div_mode1_ckdiv_flash();
}

__IRAM_SEC void sys_hal_module_power_ctrl(power_module_name_t module,power_module_state_t power_state)
{
	if(POWER_MODULE_NAME_BASE1 < module && module <= POWER_DOMAIN_NAME_NPU)
	{
		switch(module)
		{
			case POWER_DOMAIN_NAME_AP_CPU:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_ahbp_ll_set_rege_pwd_m55(0);
				}
				else
				{
					//sys_ahbp_ll_set_rege_pwd_m55(1);//ap can not directly power off AP
				}
				break;
			case POWER_DOMAIN_NAME_VIDEO_POST:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_ahbp_ll_set_rege_pwd_video_post(0);
				}
				else
				{
					sys_ahbp_ll_set_rege_pwd_video_post(1);
				}
				break;
			case POWER_DOMAIN_NAME_H26E:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_ahbp_ll_set_rege_pwd_h26e(0);
				}
				else
				{
					sys_ahbp_ll_set_rege_pwd_h26e(1);
				}
				break;
			case POWER_DOMAIN_NAME_ISP:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_ahbp_ll_set_rege_pwd_isp(0);
				}
				else
				{
					sys_ahbp_ll_set_rege_pwd_isp(1);
				}
				break;
			case POWER_DOMAIN_NAME_NPU:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_ahbp_ll_set_rege_pwd_npu(0);
				}
				else
				{
					sys_ahbp_ll_set_rege_pwd_npu(1);
				}
				break;
			default:
				break;
		}
	}
}

__IRAM_SEC int32 sys_hal_module_power_state_get(power_module_name_t module)
{
	if(POWER_MODULE_NAME_BASE1 < module && module <= POWER_MODULE_NAME_NONE)
	{
		switch(module)
		{
			case POWER_DOMAIN_NAME_AP_CPU:
				return sys_ahbp_ll_get_rege_pwd_m55();
				break;
			case POWER_DOMAIN_NAME_VIDEO_POST:
				return sys_ahbp_ll_get_rege_pwd_video_post();
				break;
			case POWER_DOMAIN_NAME_H26E:
				return sys_ahbp_ll_get_rege_pwd_h26e();
				break;
			case POWER_DOMAIN_NAME_ISP:
				return sys_ahbp_ll_get_rege_pwd_isp();
				break;
			case POWER_DOMAIN_NAME_NPU:
				return sys_ahbp_ll_get_rege_pwd_npu();
				break;
			default:
				break;
		}
	}
	return 0;
}

int sys_hal_rosc_calibration(uint32_t rosc_cali_mode, uint32_t cali_interval)
{
	return 0;
}

int sys_hal_rosc_test_mode(bool enabled)
{
	return 0;
}

void sys_hal_module_RF_power_ctrl (module_name_t module,power_module_state_t power_state)
{
	return;
}

void sys_hal_cpu0_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
	sys_ll_set_cpu0_int_halt_clk_op_cpu_int_mask(clock_state);
}

void sys_hal_cpu1_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
	// CPU0 and CPU1 share the same interrupt mask register
	sys_ll_set_cpu0_int_halt_clk_op_cpu_int_mask(clock_state);
}

void sys_hal_set_cpu1_boot_address_offset(uint32_t address_offset)
{
	sys_ll_set_cpu1_int_halt_clk_op_cpu1_offset(address_offset);
}

