bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
void sys_hal_set_cpu2_boot_address_offset(uint32_t address_offset)
{
	sys_ahbp_ll_set_reg4_cpu0_offset(address_offset);
}

void sys_hal_set_cpu1_reset(uint32_t reset_value)
{
	sys_ll_set_cpu1_int_halt_clk_op_cpu1_sw_rst(reset_value);
}

void sys_hal_set_cpu2_reset(uint32_t reset_value)
{
	sys_ahbp_ll_set_reg4_cpu0_sw_rstn(reset_value);
}

void sys_hal_set_npu_reset(uint32_t reset_value)
{
	sys_ahbp_ll_set_reg6_npu_sw_rstn(reset_value);
}

void sys_hal_set_cpu1_pwr_dw(uint32_t is_pwr_down)
{
	sys_ll_set_cpu1_int_halt_clk_op_cpu1_pwr_dw(is_pwr_down);
}

void sys_hal_set_cpu2_pwr_dw(uint32_t is_pwr_down)
{
	// CPU2 (M55 sub-core) does not support pwr_dw control in sys_ahbp_reg4
	// Power control for CPU2 is handled through aon_pmu registers
	(void)is_pwr_down;
}

void sys_hal_all_modules_clk_div_set(clk_div_reg_e reg, uint32_t value)
{
        clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
        clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

        uint32_t clk_div_reg_address = clk_div_addr->reg_address;

        REG_WRITE(clk_div_reg_address, value);
}

uint32_t sys_hal_all_modules_clk_div_get(clk_div_reg_e reg)
{
        clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
        clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

        uint32_t clk_div_reg_address = clk_div_addr->reg_address;

        return REG_READ(clk_div_reg_address);
}
void sys_hal_cpu_clk_div_set(uint32_t core_index, uint32_t value)
{
	if (core_index == 0) {
		sys_ll_set_cpu_clk_div_mode1_ckdiv_core(value);
	} else if (core_index == 1) {
		// CPU1 clock divider is controlled by the same register
		sys_ll_set_cpu_clk_div_mode1_ckdiv_core(value);
	}
}

uint32_t sys_hal_cpu_clk_div_get(uint32_t core_index)
{
	return sys_ll_get_cpu_clk_div_mode1_ckdiv_core();
}
void sys_hal_set_iobyapssen(uint32_t enable)
{
	return;
}
void sys_hal_set_violdosel(uint32_t flag)
{
	return;
}
void sys_hal_lp_anabuf_set(uint32_t v) {
	return;
}
int32 sys_hal_lp_vol_set(uint32_t value)
{
	return 0;
}
uint32_t sys_hal_lp_vol_get()
{
	return 0;
}
int32 sys_hal_rf_tx_vol_set(uint32_t value)
{
	return 0;
}
uint32_t sys_hal_rf_tx_vol_get()
{
	return 0;
}
int32 sys_hal_rf_rx_vol_set(uint32_t value)
{
	return 0;
}
uint32_t sys_hal_rf_rx_vol_get()
{
	return 0;
}
int32 sys_hal_bandgap_cali_set(uint32_t value)//increase or decrease the dvdddig voltage
{
	return 0;
}
uint32_t sys_hal_bandgap_cali_get()
{
	return 0;
}
bk_err_t sys_hal_core_bus_clock_ctrl(uint32_t cksel_core, uint32_t ckdiv_core,uint32_t ckdiv_bus, uint32_t ckdiv_cpu0,uint32_t ckdiv_cpu1)
{
	static const uint32_t core_clk_src_mhz[] = {160, 480, 640, 240};
	uint32_t clk_param;
	uint32_t next_clk_param;
	uint32_t current_cksel_core;
	uint32_t current_ckdiv_core;
	uint32_t current_freq;
	uint32_t target_freq;
	uint32_t target_cksel_core = cksel_core;
	uint32_t target_ckdiv_core = ckdiv_core << 2;
	uint32_t target_ckdiv_bus = ckdiv_bus << 4;

	(void)ckdiv_cpu0;
	(void)ckdiv_cpu1;

	if(cksel_core > PM_CLKSEL_CORE_MAX)
	{
		os_printf("Set dvfs cksel core > %d invalid\r\n",PM_CLKSEL_CORE_MAX);
		return BK_FAIL;
	}

	if((ckdiv_core > PM_FREQUNCY_DIV_MAX))
	{
		os_printf("Set dvfs ckdiv_core > %d invalid\r\n",PM_FREQUNCY_DIV_MAX);
		return BK_FAIL;
	}
	if(ckdiv_bus > 1)
	{
		os_printf("Set dvfs ckdiv_bus > 1 invalid\r\n");
		return BK_FAIL;
	}

	clk_param = sys_ahbp_ll_get_reg8_value();
	current_cksel_core = clk_param & 0x3;
	current_ckdiv_core = (clk_param >> 2) & 0x3;
	current_freq = core_clk_src_mhz[current_cksel_core] / (current_ckdiv_core + 1);
	target_freq = core_clk_src_mhz[cksel_core] / (ckdiv_core + 1);

	if(current_freq > target_freq)//when it from the higher frequency to lower frequency
	{
		/*1.core clk select*/
		next_clk_param = (clk_param & ~(0x3 << 0)) | target_cksel_core;
		if(next_clk_param != clk_param)
		{
			sys_ahbp_ll_set_reg8_value(next_clk_param);
			clk_param = next_clk_param;
		}

		/*2.config core clk div*/
		next_clk_param = (clk_param & ~(0x3 << 2)) | target_ckdiv_core;
		if(next_clk_param != clk_param)
		{
			sys_ahbp_ll_set_reg8_value(next_clk_param);
			clk_param = next_clk_param;
		}

		/*3.config bus clk div*/
		next_clk_param = (clk_param & ~(0x1 << 4)) | target_ckdiv_bus;
		if(next_clk_param != clk_param)
		{
			sys_ahbp_ll_set_reg8_value(next_clk_param);
		}
	}
	else//when it from the lower frequency to higher frequency
	{
		/*1.config bus*/
		next_clk_param = (clk_param & ~(0x1 << 4)) | target_ckdiv_bus;
		if(next_clk_param != clk_param)
		{
			sys_ahbp_ll_set_reg8_value(next_clk_param);
			clk_param = next_clk_param;
		}

		/*2.config core clk div*/
		next_clk_param = (clk_param & ~(0x3 << 2)) | target_ckdiv_core;
		if(next_clk_param != clk_param)
		{
			sys_ahbp_ll_set_reg8_value(next_clk_param);
			clk_param = next_clk_param;
		}

		/*3.core clk select*/
		next_clk_param = (clk_param & ~(0x3 << 0)) | target_cksel_core;
		if(next_clk_param != clk_param)
		{
			sys_ahbp_ll_set_reg8_value(next_clk_param);
		}
	}

	return BK_OK;
}

bk_err_t sys_hal_ctrl_vddd_h_vol(uint32_t vol_value)
{
	return 0;
}

bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value)
{
	uint32_t cur_vol = sys_ll_get_ana_reg16_vcorehssel();
	uint32_t next_vol;

	if(cur_vol == vol_value)
	{
		return BK_OK;
	}

	if(cur_vol > vol_value)
	{
		sys_ll_set_ana_reg10_spi_latch1v(1);
		sys_ll_set_ana_reg16_vcorehssel(vol_value);
		sys_ll_set_ana_reg10_spi_latch1v(0);
		return BK_OK;
	}

	sys_ll_set_ana_reg10_spi_latch1v(1);
	for(next_vol = cur_vol + 1; next_vol <= vol_value; next_vol++)
	{
		sys_ll_set_ana_reg16_vcorehssel(next_vol);
		bk_delay_us(SYS_SWITCH_VDDDIG_VOL_DELAY_TIME);
	}
	sys_ll_set_ana_reg10_spi_latch1v(0);

	return BK_OK;
}

uint32_t sys_hal_vdddig_h_vol_get()
{
	return sys_ll_get_ana_reg16_vcorehssel();
}

static const sys_hal_cpu_bus_freq_cfg_t *sys_hal_get_cpu_bus_freq_cfg(pm_cpu_freq_e cpu_bus_freq)
{
	if((uint32_t)cpu_bus_freq >= ARRAY_SIZE(s_cpu_bus_freq_cfg))
	{
		return NULL;
	}

	if(cpu_bus_freq == PM_CPU_FRQ_XTAL)
		return NULL;

	return &s_cpu_bus_freq_cfg[cpu_bus_freq];
}

