bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
static uint32_t sys_hal_cpu_freq_to_hz(pm_cpu_freq_e cpu_bus_freq)
{
	static const uint32_t cpu_clock_hz[] = {
		CONFIG_XTAL_FREQ, 80000000, 120000000, 160000000,
		240000000, 320000000, 480000000,
	};

	return cpu_clock_hz[cpu_bus_freq];
}

static bk_err_t sys_hal_set_cpu_bus_freq_clock(const sys_hal_cpu_bus_freq_cfg_t *cfg)
{
	bk_err_t ret = sys_hal_core_bus_clock_ctrl(cfg->cksel_core, cfg->ckdiv_core,
		cfg->ckdiv_bus, cfg->ckdiv_cpu0, cfg->ckdiv_cpu1);

	if(ret == BK_OK)
		rtos_setup_systick(sys_hal_cpu_freq_to_hz(cfg->freq));

	return ret;
}

static void sys_hal_set_cpu_bus_freq_ram(const sys_hal_cpu_bus_freq_cfg_t *cfg)
{
	if(cfg->freq > PM_CPU_FRQ_160M)
	{
		sys_hal_set_ram_high_speed();
	}
	else
	{
		sys_hal_set_ram_low_speed();
	}
}

bk_err_t sys_hal_switch_cpu_bus_freq_high_to_low(pm_cpu_freq_e cpu_bus_freq)
{
	const sys_hal_cpu_bus_freq_cfg_t *cfg = sys_hal_get_cpu_bus_freq_cfg(cpu_bus_freq);
	bk_err_t ret;

	if(cfg == NULL)
		return BK_FAIL;

	ret = sys_hal_set_cpu_bus_freq_clock(cfg);
	SYS_PM_HAL_CPU_BARRIER();

	if(ret != BK_OK)
		return ret;

	sys_hal_set_cpu_bus_freq_ram(cfg);
	SYS_PM_HAL_CPU_BARRIER();

	sys_hal_ctrl_vddd_h_vol(PM_VDDD_H_VOL_1V);
	sys_hal_ctrl_vdddig_h_vol(cfg->vdddig_vol);
	SYS_PM_HAL_CPU_BARRIER();

	return BK_OK;
}

bk_err_t sys_hal_switch_cpu_bus_freq_low_to_high(pm_cpu_freq_e cpu_bus_freq)
{
	const sys_hal_cpu_bus_freq_cfg_t *cfg = sys_hal_get_cpu_bus_freq_cfg(cpu_bus_freq);
	bk_err_t ret;

	if(cfg == NULL)
		return BK_FAIL;

	sys_hal_ctrl_vddd_h_vol(PM_VDDD_H_VOL_1V);
	sys_hal_ctrl_vdddig_h_vol(cfg->vdddig_vol);
	SYS_PM_HAL_CPU_BARRIER();

	sys_hal_set_cpu_bus_freq_ram(cfg);
	SYS_PM_HAL_CPU_BARRIER();

	ret = sys_hal_set_cpu_bus_freq_clock(cfg);
	SYS_PM_HAL_CPU_BARRIER();

	return ret;
}

static pm_cpu_freq_e s_pre_cpu_freq = PM_CPU_FRQ_XTAL;

pm_cpu_freq_e sys_hal_get_cpu_bus_freq(void)
{
	return s_pre_cpu_freq;
}

bk_err_t sys_hal_switch_cpu_bus_freq(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	pm_cpu_freq_e prev_freq = s_pre_cpu_freq;

	if(prev_freq == cpu_bus_freq)
		return BK_OK;

	if(prev_freq > cpu_bus_freq)// eg: 480->60
	{
		ret = sys_hal_switch_cpu_bus_freq_high_to_low(cpu_bus_freq);
	}
	else // eg: 60-480
	{
		ret = sys_hal_switch_cpu_bus_freq_low_to_high(cpu_bus_freq);
	}
	if(ret == BK_OK)
	{
		s_pre_cpu_freq = cpu_bus_freq;
	}
	return ret;
}


/*for low power function end*/
/*sleep feature end*/
uint32 sys_hal_get_chip_id(void)
{
	return sys_ll_get_version_id_versionid();
}

uint32 sys_hal_get_device_id(void)
{
	return sys_ll_get_device_id_deviceid();
}

void sys_hal_set_ram_sph_cfg(uint32_t value)
{
	sys_ahbp_ll_set_reg50_value(value);
}

void sys_hal_set_ram_tph_cfg(uint32_t value)
{
	sys_ahbp_ll_set_reg51_value(value);
}

void sys_hal_set_ram_spl_cfg(uint32_t value)
{
	sys_ahbp_ll_set_reg52_value(value);
}

void sys_hal_set_ram_tpl_cfg(uint32_t value)
{
	sys_ahbp_ll_set_reg53_value(value);
}

void sys_hal_set_ram_high_speed(void)
{

	/* When running at high frequency (more than half of the maximum frequency),
	 * RAM CFG parameters need to be modified. Please modify the configuration
	 * in the initialization program. This RAM parameter affects RAM speed and
	 * yield. RAM library recommends using high-speed configuration for
	 * high-speed operation and low-speed configuration for low-speed operation.
	 */
    //  uint32_t ram_sph_cfg = 0x0;//Default: 0x442 << 10 | 0x242;
    //  ram_sph_cfg = 0x441 << 10 | 0x241;
    //  sys_hal_set_ram_sph_cfg(0x5A << 24 | ram_sph_cfg); ///Default: Low-speed configuration
    //  sys_hal_set_ram_sph_cfg(0xA5 << 24 | ram_sph_cfg); ///Default: Low-speed configuration

    //  uint32_t ram_tph_cfg = 0x0;//Default: 0x902;
    //  ram_tph_cfg = 0x901;
    //  sys_hal_set_ram_tph_cfg(0x5A << 24 | ram_tph_cfg); ///Default: Low-speed configuration
    //  sys_hal_set_ram_tph_cfg(0xA5 << 24 | ram_tph_cfg); ///Default: Low-speed configuration

	 uint32_t ram_spl_cfg = 0x0;//Default: 0x444 << 10 | 0x244;
     ram_spl_cfg = 0x443 << 10 | 0x243;
     sys_hal_set_ram_spl_cfg(0x5A << 24 | ram_spl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_spl_cfg(0xA5 << 24 | ram_spl_cfg); ///Default: Low-speed configuration

     uint32_t ram_tpl_cfg = 0x0;//Default: 0x904;
     ram_tpl_cfg = 0x903;
     sys_hal_set_ram_tpl_cfg(0x5A << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_tpl_cfg(0xA5 << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
}

void sys_hal_set_ram_low_speed(void)
{

	/* When running at high frequency (more than half of the maximum frequency),
	 * RAM CFG parameters need to be modified. Please modify the configuration
	 * in the initialization program. This RAM parameter affects RAM speed and
	 * yield. RAM library recommends using high-speed configuration for
	 * high-speed operation and low-speed configuration for low-speed operation.
	 */
    //  uint32_t ram_sph_cfg = 0x0;//Default: 0x442 << 10 | 0x242;
    //  ram_sph_cfg = 0x442 << 10 | 0x242;
    //  sys_hal_set_ram_sph_cfg(0x5A << 24 | ram_sph_cfg);
    //  sys_hal_set_ram_sph_cfg(0xA5 << 24 | ram_sph_cfg);

    //  uint32_t ram_tph_cfg = 0x0;//Default: 0x902;
    //  ram_tph_cfg = 0x902;
    //  sys_hal_set_ram_tph_cfg(0x5A << 24 | ram_tph_cfg);
    //  sys_hal_set_ram_tph_cfg(0xA5 << 24 | ram_tph_cfg);

	 uint32_t ram_spl_cfg = 0x0;//Default: 0x444 << 10 | 0x244;
     ram_spl_cfg = 0x443 << 10 | 0x243;
     sys_hal_set_ram_spl_cfg(0x5A << 24 | ram_spl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_spl_cfg(0xA5 << 24 | ram_spl_cfg); ///Default: Low-speed configuration

     uint32_t ram_tpl_cfg = 0x0;//Default: 0x904;
     ram_tpl_cfg = 0x903;
     sys_hal_set_ram_tpl_cfg(0x5A << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_tpl_cfg(0xA5 << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
}

__IRAM_SEC int32_t sys_hal_set_int_en(uint32_t core_id, uint32_t int_num, uint32_t int_en)
{
	uint32_t reg = 0;
	uint32_t value = 0;

	switch (core_id) {
	case 0:
		reg = REG_READ(SYS_CPU0_INT_0_31_EN_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_CPU0_INT_0_31_EN_ADDR + ((int_num / 32) << 2), reg);
		break;
	case 1:
		reg = REG_READ(SYS_CPU1_INT_0_31_EN_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_CPU1_INT_0_31_EN_ADDR + ((int_num / 32) << 2), reg);
		break;
	case 2:
		reg = REG_READ(SYS_AHBP_REG10_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_AHBP_REG10_ADDR + ((int_num / 32) << 2), reg);
		break;
	case 3:
		reg = REG_READ(SYS_AHBP_REG12_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_AHBP_REG12_ADDR + ((int_num / 32) << 2), reg);
		break;
	default:
		break;
	}

	return value;
}


__IRAM_SEC int32_t sys_hal_set_m55sub_int_en(uint32_t int_num, uint32_t int_en)
{
	uint32_t reg = 0;
	uint32_t value = 0;

	if (int_num < 32) {
		reg = sys_ll_get_m55sub_int_0_31_en_m55sub_inten();
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		sys_ll_set_m55sub_int_0_31_en_m55sub_inten(reg);
	} else if (int_num < 64) {
		reg = sys_ll_get_m55sub_int_32_63_en_m55sub_inten();
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		sys_ll_set_m55sub_int_32_63_en_m55sub_inten(reg);
	} else if (int_num < INT_SRC_CP_MAX_NUM) {
		reg = sys_ll_get_m55sub_int_64_95_en_m55sub_inten();
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		sys_ll_set_m55sub_int_64_95_en_m55sub_inten(reg);
	}
	return value;
}

__IRAM_SEC int32_t sys_hal_get_m55sub_int_en()
{
	uint32_t reg = 0;

	reg = sys_ll_get_m55sub_int_0_31_en_m55sub_inten();
	if (reg & 0xFFFFFFFF) {
		return 1;
	}

	reg = sys_ll_get_m55sub_int_32_63_en_m55sub_inten();
	if (reg & 0xFFFFFFFF) {
		return 1;
	}

	reg = sys_ll_get_m55sub_int_64_95_en_m55sub_inten();
	if (reg & 0x3FFFF) {
		return 1;
	}

