bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
	return 0;
}


__IRAM_SEC int32_t sys_hal_get_m55sub_int_status0(void)
{
	uint32_t value = 0;
	value = sys_ll_get_m55sub_int_0_31_status_m55sub_status0();
	return value;
}

__IRAM_SEC int32_t sys_hal_get_m55sub_int_status1(void)
{
	uint32_t value = 0;
	value = sys_ll_get_m55sub_int_32_63_status_m55sub_status1();
	return value;
}

__IRAM_SEC int32_t sys_hal_get_m55sub_int_status2(void)
{
	uint32_t value = 0;
	value = sys_ll_get_m55sub_int_64_95_status_m55sub_status2();
	return value;
}

///TODO: To be removed
__IRAM_SEC int32 sys_hal_int_disable(uint32_t core_index, uint32 param) //CMD_ICU_INT_DISABLE
{
	uint32 reg = 0;
	uint32 value = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_0_31_en_cpu0_inten();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_0_31_en_cpu0_inten(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_0_31_en_cpu1_inten();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_0_31_en_cpu1_inten(reg);
	}
	return value;
}

///TODO: To be removed
__IRAM_SEC int32 sys_hal_int_enable(uint32_t core_index,uint32 param) //CMD_ICU_INT_ENABLE
{
	uint32 reg = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_0_31_en_cpu0_inten();
		reg |= (param);
		sys_ll_set_cpu0_int_0_31_en_cpu0_inten(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_0_31_en_cpu1_inten();
		reg |= (param);
		sys_ll_set_cpu1_int_0_31_en_cpu1_inten(reg);
	}
	return 0;
}

///TODO: To be removed
__IRAM_SEC int32 sys_hal_int_group2_disable(uint32_t core_index,uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	return value;
}

///TODO: To be removed
__IRAM_SEC int32 sys_hal_int_group2_enable(uint32_t core_index,uint32 param)
{
	uint32 reg = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	return 0;
}

///TODO: To be removed
int32 sys_hal_core_int_group1_disable(uint32_t core_id, uint32 param)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_core_int_group1_enable(uint32_t core_id, uint32 param)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_core_int_group2_disable(uint32_t core_id, uint32 param)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_core_int_group2_enable(uint32_t core_id, uint32 param)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_fiq_disable(uint32_t core_index,uint32 param)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_fiq_enable(uint32_t core_index,uint32 param)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_global_int_disable(uint32 param)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_global_int_enable(uint32 param)
{
	return 0;
}

///TODO: To be removed
uint32 sys_hal_get_int_status(uint32_t core_index)
{
	return 0;
}

///TODO: To be removed
__attribute__((section(".itcm_sec_code"))) uint32 sys_hal_get_int_group2_status(uint32_t core_index)
{
	return 0;
}

///TODO: To be removed
uint32_t sys_hal_get_cpu0_gpio_int_st(void)
{
	return 0;
}

///TODO: To be removed
int32 sys_hal_set_int_status(uint32 param)
{
	return 0;
}

///TODO: To be removed
uint32 sys_hal_get_fiq_reg_status(uint32_t core_index)
{
	return 0;
}

///TODO: To be removed
uint32 sys_hal_set_fiq_reg_status(uint32 param)
{
	return 0;
}

///TODO: To be removed
uint32 sys_hal_get_intr_raw_status(void)
{
	return 0;
}

///TODO: To be removed
uint32 sys_hal_set_intr_raw_status(uint32 param)
{
	return 0;
}

int32 sys_hal_set_jtag_mode(uint32 param)
{
	//BK7259 need not set
	return BK_OK;
}

uint32 sys_hal_get_jtag_mode(void)
{
	//BK7259 need not get
	return BK_OK;
}

__IRAM_SEC void sys_hal_clk_pwr_ctrl(dev_clk_pwr_id_t dev, dev_clk_pwr_ctrl_t power_up)
{
	uint32_t reg_val = 0;

	if (dev < 32) {
		reg_val = sys_ll_get_cpu_device_clk_enable_value();
		if (power_up == CLK_PWR_CTRL_PWR_UP) {
			reg_val |= BIT(dev);
		} else {
			reg_val &= ~BIT(dev);
		}
		sys_ll_set_cpu_device_clk_enable_value(reg_val);
	} else if (dev < 64) {
		reg_val = sys_ll_get_reserver_reg0xd_value();
		if (power_up == CLK_PWR_CTRL_PWR_UP) {
			reg_val |= BIT(dev - 32);
		} else {
			reg_val &= ~BIT(dev - 32);
		}
		sys_ll_set_reserver_reg0xd_value(reg_val);
	} else {
		reg_val = sys_ahbp_ll_get_rega_value();
		if (power_up == CLK_PWR_CTRL_PWR_UP) {
			reg_val |= BIT(dev - 64);
		} else {
			reg_val &= ~BIT(dev - 64);
		}
		sys_ahbp_ll_set_rega_value(reg_val);
	}
}

void sys_hal_uart_select_clock(uart_id_t id, uart_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_appl = 1;

	switch(id)
	{
		case UART_ID_0:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode2_cksel_uart0(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode2_cksel_uart0(sel_xtal);
				break;
			}
		case UART_ID_1:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode2_cksel_uart1(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode2_cksel_uart1(sel_xtal);
				break;
			}
		case UART_ID_2:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode2_cksel_uart2(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode2_cksel_uart2(sel_xtal);
				break;
			}
		case UART_ID_3:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode2_cksel_uart3(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode2_cksel_uart3(sel_xtal);
				break;
			}
		case UART_ID_4:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode2_cksel_uart4(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode2_cksel_uart4(sel_xtal);
				break;
			}
		case UART_ID_5:
			{
				sys_ahbp_ll_set_reg8_ckdiv_uart5(0); //120M/(N+1)
				break;
			}
		default:
			break;
	}
}

void sys_hal_i2c_select_clock(i2c_id_t id, i2c_src_clk_t mode)
{
	uint32_t sel_value = 0;

