bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
	switch (mode) {
		case I2C_SCLK_XTAL:
			sel_value = 0;
			break;
		case I2C_SCLK_120M:
			sel_value = 1;
			break;
		default:
			break;
	}

	switch (id) {
		case I2C_ID_0:
			sys_ll_set_cpu_clk_div_mode2_cksel_i2c0(sel_value);
			break;
#if (SOC_I2C_UNIT_NUM > 1)
		case I2C_ID_1:
			sys_ll_set_cpu_clk_div_mode2_cksel_i2c3(sel_value);
			break;
#endif
		default:
			break;
	}
}

void sys_hal_pwm_select_clock(sys_sel_pwm_t num, pwm_src_clk_t mode)
{
	uint32_t sel_value = 0;

	switch (mode) {
		case PWM_SCLK_XTAL:
			sel_value = 1;
			break;
		case PWM_SCLK_CLK32:
		default:
			sel_value = 0;
			break;
	}

	switch (num) {
		case SYS_SEL_PWM0:
			sys_ll_set_cpu_clk_div_mode3_cksel_pwm0(sel_value);
			break;
		default:
			break;
	}
}

void sys_hal_timer_select_clock(sys_sel_timer_t num, timer_src_clk_t mode)
{
	uint32_t sel_value = 0;

	switch (mode) {
		case TIMER_SCLK_XTAL:
			sel_value = 1;
			break;
		case TIMER_SCLK_CLK32:
		default:
			sel_value = 0;
			break;
	}

	switch (num) {
		case SYS_SEL_TIMER0:
			sys_ll_set_cpu_clk_div_mode2_cksel_tim0(sel_value);
			break;
		case SYS_SEL_TIMER1:
			sys_ll_set_cpu_clk_div_mode2_cksel_tim1(sel_value);
			break;
		default:
			break;
	}
}

uint32_t sys_hal_timer_select_clock_get(sys_sel_timer_t id)
{
	uint32_t ret = 0;

	switch (id) {
		case SYS_SEL_TIMER0:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_tim0();
			break;
		case SYS_SEL_TIMER1:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_tim1();
			break;
		default:
			break;
	}

	ret = (ret) ? TIMER_SCLK_XTAL : TIMER_SCLK_CLK32;

	return ret;
}

void sys_hal_spi_select_clock(spi_id_t num, spi_src_clk_t mode)
{
	uint32_t sel_value = 0;

	switch (mode) {
		case SPI_CLK_160MHZ:
			sel_value = 1;
			break;
		case SPI_CLK_XTAL:
		default:
			sel_value = 0;
			break;
	}

	switch (num) {
		case SPI_ID_0:
			sys_ll_set_cpu_clk_div_mode2_cksel_spi0(sel_value);
			break;
#if (SOC_SPI_UNIT_NUM > 1)
		case SPI_ID_1:
			sys_ll_set_cpu_clk_div_mode2_cksel_spi1(sel_value);
			break;
#endif
#if (SOC_SPI_UNIT_NUM > 2)
		case SPI_ID_2:
			sys_ll_set_cpu_clk_div_mode2_cksel_spi2(sel_value);
			break;
#endif
#if (SOC_SPI_UNIT_NUM > 3)
		case SPI_ID_3:
			sys_ll_set_cpu_clk_div_mode2_cksel_spi3(sel_value);
			break;
#endif
		default:
			break;
	}
}

void sys_hal_qspi_clk_sel(uint32_t id, uint32_t param)
{
	switch (id) {
		case QSPI_ID_0:
			sys_ahbp_ll_set_reg8_cksel_qspi0(param);
			break;
#if (SOC_QSPI_UNIT_NUM > 1)
		case QSPI_ID_1:
			sys_ahbp_ll_set_reg8_cksel_qspi1(param);
			break;
#endif
		default:
			break;
	}
}

void sys_hal_qspi_set_src_clk_div(uint32_t id, uint32_t value)
{
	switch (id) {
		case QSPI_ID_0:
			sys_ahbp_ll_set_reg8_ckdiv_qspi0(value);
			break;
#if (SOC_QSPI_UNIT_NUM > 1)
		case QSPI_ID_1:
			sys_ahbp_ll_set_reg8_ckdiv_qspi1(value);
			break;
#endif
		default:
			break;
	}
}

uint32_t sys_hal_sdio0_get_src_clk_div(void)
{
	return sys_ahbp_ll_get_reg8_ckdiv_sdio0();
}

uint32_t sys_hal_sdio1_get_src_clk_div(void)
{
	return sys_ahbp_ll_get_reg8_ckdiv_sdio1();
}

void sys_hal_sdio0_set_src_clk_div(uint32_t value)
{
	sys_ahbp_ll_set_reg8_ckdiv_sdio0(value);
}

void sys_hal_sdio1_set_src_clk_div(uint32_t value)
{
	sys_ahbp_ll_set_reg8_ckdiv_sdio1(value);
}

uint32_t sys_hal_sdio0_get_cken(void)
{
	return sys_ahbp_ll_get_rega_sdio0_cken();
}

uint32_t sys_hal_sdio1_get_cken(void)
{
	return sys_ahbp_ll_get_rega_sdio1_cken();
}

void sys_hal_sdio0_set_cken(uint32_t value)
{
	sys_ahbp_ll_set_rega_sdio0_cken(value);
}

void sys_hal_sdio1_set_cken(uint32_t value)
{
	sys_ahbp_ll_set_rega_sdio1_cken(value);
}

#if 1	//tmp build
void sys_hal_set_clk_select(dev_clk_select_id_t dev, dev_clk_select_t clk_sel)
{
	return;
}
dev_clk_select_t sys_hal_get_clk_select(dev_clk_select_id_t dev)
{
	return 0;
}
//DCO divider is valid for all of the peri-devices.
void sys_hal_set_dco_div(dev_clk_dco_div_t div)
{
	return;
}
//DCO divider is valid for all of the peri-devices.
dev_clk_dco_div_t sys_hal_get_dco_div(void)
{
	return CLK_DCO_DIV_1;
}
#endif	//temp build
/*clock power control end*/
void sys_hal_set_cksel_sadc(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_sadc(value);
}

void sys_hal_set_cksel_pwm0(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode3_cksel_pwm0(value);
}

void sys_hal_set_cksel_pwm1(uint32_t value)
{
	// BK7259 only supports PWM0 clock selection
	(void)value;
}

void sys_hal_set_cksel_pwm(uint32_t value)
{
	sys_hal_set_cksel_pwm0(value);
}
uint32_t sys_hal_uart_select_clock_get(uart_id_t id)
{
	uint32_t ret = 0;

	switch (id) {
		case UART_ID_0:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart0();
			break;
		case UART_ID_1:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart1();
			break;
		case UART_ID_2:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart2();
			break;
		case UART_ID_3:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart3();
			break;
		case UART_ID_4:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart4();
			break;
		case UART_ID_5:
			ret = sys_ahbp_ll_get_reg8_ckdiv_uart5();
			break;
		default:
			ret = 0;
			break;
	}
	return ret;
}
uint32_t sys_hal_i2c_select_clock_get(i2c_id_t id)
{
	uint32_t ret = 0;

	switch (id) {
		case I2C_ID_0:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_i2c0();
			break;
#if (SOC_I2C_UNIT_NUM > 1)
		case I2C_ID_1:
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_i2c3();
			break;
#endif
		default:
			break;
	}

	ret = (ret) ? I2C_SCLK_XTAL : I2C_SCLK_120M;

	return ret;
}
void sys_hal_sadc_int_enable(void)
{
	// sadc handled by CPU0
}

void sys_hal_sadc_int_disable(void)
{
	// sadc handled by CPU0
}

void sys_hal_sadc_pwr_up(void)
{
	return;
}
void sys_hal_sadc_pwr_down(void)
{
	return;
}
void sys_hal_set_saradc_config(void)
{
	return;
}
void sys_hal_set_sdmadc_config(void)
{
	return;
}
void sys_hal_set_clksel_spi0(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_spi0(value);
}

void sys_hal_set_clksel_spi1(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_spi1(value);
}

void sys_hal_set_clksel_spi(uint32_t value)
{
	if ((SPI_CLK_XTAL == value) || (SPI_CLK_APLL == value)) {
		sys_ll_set_cpu_clk_div_mode2_cksel_spi0(value);
		sys_ll_set_cpu_clk_div_mode2_cksel_spi1(value);
	}
}

void sys_hal_en_tempdet(uint32_t value)
{
	return;
}

uint32_t sys_hal_mclk_mux_get(void)
{
	return 0;
}
void sys_hal_mclk_mux_set(uint32_t value)
{
	return;
}

uint32_t sys_hal_mclk_div_get(void)
{
	return 0;
}

