bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
void sys_hal_mclk_div_set(uint32_t value)
{
	return;
}
/**  Platform End **/
/**  BT Start **/
//BT
void sys_hal_bt_power_ctrl(bool power_up)
{
	return;
}

void sys_hal_bt_clock_ctrl(bool en)
{
	return;
}

void sys_hal_xvr_clock_ctrl(bool en)
{
	if (en) {
		sys_ll_set_reserver_reg0xf_xvr_mem_ret(0);
	} else {
		sys_ll_set_reserver_reg0xf_xvr_mem_ret(1);
	}
}

void sys_hal_btdm_interrupt_ctrl(bool en)
{
	return;
}

void sys_hal_ble_interrupt_ctrl(bool en)
{
	return;
}

void sys_hal_bt_interrupt_ctrl(bool en)
{
	return;
}

void sys_hal_bt_rf_ctrl(bool en)
{
	return;
}

void sys_hal_rf_ctrl(uint8_t type)
{
	return;
}

uint8_t sys_hal_rf_ctrl_type_get(void)
{
	return 0;
}
uint32_t sys_hal_bt_rf_status_get(void)
{
	return 0;
}
void sys_hal_bt_sleep_exit_ctrl(bool en)
{
	return;
}

void sys_hal_set_bts_wakeup_platform_en(bool value)
{
	return;
}
uint32 sys_hal_get_bts_wakeup_platform_en()
{
	return 0;
}
/**  BT End **/
/**  Audio Start **/
//Audio
/**  Audio End **/
/**  Video Start **/
/**
  * @brief	lcd_disp  system config
  * param1: clk source sel 0:clk_320M      1:clk_480M,
  * param2: clk_div  F/(1+clkdiv_disp_l+clkdiv_disp_h*2)
  * param1: int_en eanble lcd cpu int
  * param2: clk_always_on, BUS_CLK ENABLE,0: bus clock open when module is select,1:bus clock always open,  0 by defult
  * return none
  */
void sys_hal_lcd_disp_clk_en(uint8_t clk_src_sel, uint8_t clk_div_l, uint8_t clk_div_h, uint8_t clk_always_on)
{
	return;
}
/**
  * @brief	lcd clk close and int disable, reg value recover default.
  * return none
  */
void sys_hal_lcd_disp_close(void)
{
	return;
}
/**
  * @brief	dma2d system config
  * param1: clk source sel 0:clk_320M	   1:clk_480M,
  * param2: clk_always_on  ENABLE,0: bus clock auto open when module is select,1:bus clock always open
  * param1: int_en eanble lcd cpu int
  * return none
  */
void sys_hal_dma2d_clk_en(uint8_t clk_always_on)
{
	return;
}
void sys_hal_set_jpeg_dec_disckg(uint32_t value)
{
	return;
}
/**  Video End **/
/**  WIFI Start **/
//WIFI
//Yantao Add Start
void sys_hal_modem_core_reset(void)
{
	return;
}
void sys_hal_mpif_invert(void)
{
	return;
}
void sys_hal_modem_subsys_reset(void)
{
	return;
}
void sys_hal_mac_subsys_reset(void)
{
	return;
}
void sys_hal_usb_subsys_reset(void)
{
	return;
}
void sys_hal_dsp_subsys_reset(void)
{
	return;
}
void sys_hal_mac_power_ctrl(bool power_up)
{
	return;
}
void sys_hal_modem_power_ctrl(bool power_up)
{
	return;
}
void sys_hal_pta_ctrl(bool pta_en)
{
	return;
}
__IRAM_SEC void sys_hal_modem_bus_clk_ctrl(bool clk_en)
{
	return;
}
__IRAM_SEC void sys_hal_modem_clk_ctrl(bool clk_en)
{
	return;
}
void sys_hal_mac_bus_clk_ctrl(bool clk_en)
{
	return;
}
void sys_hal_mac_clk_ctrl(bool clk_en)
{
	return;
}
void sys_hal_set_vdd_value(uint32_t param)
{
	return;
}
uint32_t sys_hal_get_vdd_value(void)
{
	return 0;
}
//CMD_SCTRL_BLOCK_EN_MUX_SET
void sys_hal_block_en_mux_set(uint32_t param)
{
	return;
}
void sys_hal_enable_mac_gen_int(void)
{
	return;
}
void sys_hal_enable_mac_prot_int(void)
{
	return;
}
void sys_hal_enable_mac_tx_trigger_int(void)
{
	return;
}
void sys_hal_enable_mac_rx_trigger_int(void)
{
	return;
}
void sys_hal_enable_mac_txrx_misc_int(void)
{
	return;
}
void sys_hal_enable_mac_txrx_timer_int(void)
{
	return;
}
void sys_hal_enable_modem_int(void)
{
	return;
}
void sys_hal_enable_modem_rc_int(void)
{
	return;
}
void sys_hal_enable_hsu_int(void)
{
	return;
}
void sys_hal_disable_hsu_int(void)
{
	return;
}
void sys_hal_set_debug_mux(int type)
{
	return;
}
void sys_hal_diag_debug_mac()
{
	return;
}
void sys_hal_diag_debug_phy()
{
	return;
}
void dbg_enable_debug_gpio(void)
{
	return;
}
//Yantao Add End
void sys_hal_cali_dpll_spi_trig_disable(void)
{
	return;
}
void sys_hal_cali_dpll_spi_trig_enable(void)
{
	return;
}
void sys_hal_cali_dpll_spi_detect_disable(void)
{
	return;
}
void sys_hal_cali_dpll_spi_detect_enable(void)
{
	return;
}
void sys_hal_set_xtalh_ctune(uint32_t value)
{
	sys_ll_set_ana_reg3_ctune(value);
}
void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
	uint32_t analog_reg_address;

	if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
		return;
	}

	analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value(analog_reg_address, value);
}

uint32_t sys_hal_analog_get(analog_reg_t reg)
{
	uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value(analog_reg_address);
}

void sys_hal_set_ana_reg1_value(uint32_t value)
{
	sys_ll_set_ana_reg1_value(value);
}
void sys_hal_set_ana_reg2_value(uint32_t value)
{
	sys_ll_set_ana_reg2_value(value);
}
void sys_hal_set_ana_reg3_value(uint32_t value)
{
	sys_ll_set_ana_reg3_value(value);
}
void sys_hal_set_ana_reg4_value(uint32_t value)
{
	sys_ll_set_ana_reg4_value(value);
}
void sys_hal_set_ana_reg12_value(uint32_t value)
{
	sys_ll_set_ana_reg12_value(value);
}
void sys_hal_set_ana_reg13_value(uint32_t value)
{
	sys_ll_set_ana_reg13_value(value);
}
void sys_hal_set_ana_reg14_value(uint32_t value)
{
	sys_ll_set_ana_reg14_value(value);
}
void sys_hal_set_ana_reg15_value(uint32_t value)
{
	sys_ll_set_ana_reg15_value(value);
}
void sys_hal_set_ana_reg16_value(uint32_t value)
{
	sys_ll_set_ana_reg16_value(value);
}
void sys_hal_set_ana_reg17_value(uint32_t value)
{
	sys_ll_set_ana_reg17_value(value);
}
void sys_hal_set_ana_reg18_value(uint32_t value)
{
	sys_ll_set_ana_reg18_value(value);
}
void sys_hal_set_ana_reg19_value(uint32_t value)
{
	sys_ll_set_ana_reg19_value(value);
}
void sys_hal_set_ana_reg20_value(uint32_t value)
{
	sys_ll_set_ana_reg20_value(value);
}
void sys_hal_set_ana_reg21_value(uint32_t value)
{
	sys_ll_set_ana_reg21_value(value);
}
void sys_hal_set_ana_reg25_value(uint32_t value)
{
    sys_ll_set_ana_reg25_value(value);
}
void sys_hal_set_ana_reg27_value(uint32_t value)
{
    sys_ll_set_ana_reg27_value(value);
}
void sys_hal_set_ana_reg28_value(uint32_t value)
{
    sys_ll_set_ana_reg28_value(value);
}
void sys_hal_set_ana_reg29_value(uint32_t value)
{
    sys_ll_set_ana_reg29_value(value);
}
void sys_hal_set_ana_reg30_value(uint32_t value)
{
    sys_ll_set_ana_reg30_value(value);
}

uint32_t sys_hal_bias_reg_read(void)
{
	return 0;
}
uint32_t sys_hal_bias_reg_write(uint32_t param)
{
	return 0;
}
uint32_t sys_hal_analog_reg2_get(void)
{
	return sys_ll_get_ana_reg2_value();
}
uint32_t sys_hal_bias_reg_set(uint32_t param)
{
	return 0;
}
uint32_t sys_hal_bias_reg_clean(uint32_t param)
{
	return 0;
}
uint32_t sys_hal_get_xtalh_ctune(void)
{
	return sys_ll_get_ana_reg3_ctune();
}
uint32_t sys_hal_cali_bgcalm(void)
{
	return 0;
}
uint32_t sys_hal_get_bgcalm(void)
{
	return sys_ll_get_ana_reg9_bgcal();
}
void sys_hal_set_bgcalm(uint32_t value)
{
	sys_ll_set_ana_reg9_bgcal(value);
}
void sys_hal_set_audioen(uint32_t value)
{
	sys_ll_set_ana_reg25_audioen(value);
}
void sys_hal_set_dpll_div_cksel(uint32_t value)
{
	sys_ll_set_ana_reg0_cksel(value);
}
void sys_hal_set_dpll_reset(uint32_t value)
{
	sys_ll_set_ana_reg7_spi_rstn(value);
}
void sys_hal_set_gadc_ten(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_en_spi(value);
}
/**  WIFI End **/
/**  Audio Start  **/
void sys_hal_aud_select_clock(uint32_t value)
{
    sys_ll_set_cpu_clk_div_mode3_cksel_audio(value);
}
void sys_hal_aud_set_ckdiv_audio(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode3_ckdiv_audio(value);
}
void sys_hal_aud_clock_en(uint32_t value)
{
    sys_ll_set_reserver_reg0xd_audio_cken(value);
}

