bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
void sys_hal_aud_dacl_en(uint32_t value)
{
    sys_ll_set_ana_reg29_daclen(value);
}
void sys_hal_aud_diffen_en(uint32_t value)
{
	return;
}
void sys_hal_aud_mic_rst_set(uint32_t value)
{
	return;
}
void sys_hal_aud_mic1_en(uint32_t value)
{
    sys_ll_set_ana_reg21_micen_mic1(value);
}
void sys_hal_aud_mic1_rst_set(uint32_t value)
{
    sys_ll_set_ana_reg21_rst_mic1(value);
}
void sys_hal_aud_mic1_gain_set(uint32_t value)
{
    sys_ll_set_ana_reg21_micgain_mic1(value);
}
void sys_hal_aud_mic1_single_en(uint32_t value)
{
    sys_ll_set_ana_reg21_micsingleen_mic1(value);
}
void sys_hal_aud_dac_diffen_en(uint32_t value)
{
	sys_ll_set_ana_reg29_diffen(value);
}
void sys_hal_aud_dcoc_en(uint32_t value)
{
    sys_ll_set_ana_reg29_lendcoc(value);
}

void sys_hal_aud_dac_bias_en(uint32_t value)
{
    sys_ll_set_ana_reg20_enaudbias(value);
}
void sys_hal_aud_dac_ldcoc_en(uint32_t value)
{
    sys_ll_set_ana_reg29_lendcoc(value);
}
void sys_hal_aud_dac_rdcoc_en(uint32_t value)
{
    sys_ll_set_ana_reg29_rendcoc(value);
}
void sys_hal_aud_dac_enbs_en(uint32_t value)
{
    sys_ll_set_ana_reg30_enbs(value);
}

void sys_hal_aud_looprst0v9_en(uint32_t value)
{
    sys_ll_set_ana_reg30_looprst0v9(value);
}

void sys_hal_aud_lmdcin_set(uint32_t value)
{
	return;
}
void sys_hal_aud_audbias_en(uint32_t value)
{
	sys_ll_set_ana_reg20_enaudbias(value);
}
void sys_hal_aud_adcbias_en(uint32_t value)
{
    sys_ll_set_ana_reg20_enadcbias(value);
}
void sys_hal_aud_micbias_en(uint32_t value)
{
    sys_ll_set_ana_reg20_enmicbias(value);
}

void sys_hal_aud_idacl_en(uint32_t value)
{
	sys_ll_set_ana_reg30_enidacl(value);
}

void sys_hal_aud_idacr_en(uint32_t value)
{
	sys_ll_set_ana_reg30_enidacr(value);
}
void sys_hal_aud_dac_drv_en(uint32_t value)
{
    sys_ll_set_ana_reg29_dacdrven(value);
}

void sys_hal_aud_int_en(uint32_t value)
{
	//sys_ll_set_cpu0_int_0_31_en_aud_int(value); ///cm33
    sys_ll_set_cpu0_int_0_31_en_cpu0_aud_int_en(value);
}
void sys_hal_aud_power_en(uint32_t value)
{
	return;
}
void sys_hal_aud_lvcmd_en(uint32_t value)
{
	return;
}
void sys_hal_aud_micbias1v_en(uint32_t value)
{
	return;
}
void sys_hal_aud_micbias_trim_set(uint32_t value)
{
	return;
}
void sys_hal_aud_audpll_en(uint32_t value)
{
	return;
}
void sys_hal_aud_dacr_en(uint32_t value)
{
    sys_ll_set_ana_reg29_dacren(value);
}
void sys_hal_aud_vdd1v_en(uint32_t value)
{
	return;
}
void sys_hal_aud_vdd1v5_en(uint32_t value)
{
	return;
}
void sys_hal_aud_mic2_en(uint32_t value)
{
    sys_ll_set_ana_reg27_micen_mic2(value);
}
void sys_hal_aud_mic2_rst_set(uint32_t value)
{
    sys_ll_set_ana_reg27_rst_mic2(value);
}
void sys_hal_aud_mic2_gain_set(uint32_t value)
{
    sys_ll_set_ana_reg27_micgain_mic2(value);
}
void sys_hal_aud_mic2_single_en(uint32_t value)
{
    sys_ll_set_ana_reg27_micsingleen_mic2(value);
}
void sys_hal_aud_dacg_set(uint32_t value)
{
    sys_ll_set_ana_reg29_dacg(value);
}
void sys_hal_aud_aud_en(uint32_t value)
{
	return;
}
void sys_hal_aud_rvcmd_en(uint32_t value)
{
	return;
}
void sys_hal_dmic_clk_div_set(uint32_t value)
{
	return;
}
void sys_hal_aud_dac_dacmute_en(uint32_t value)
{
	sys_ll_set_ana_reg29_dacmute(value);
}
void sys_hal_aud_mic3_en(uint32_t value)
{
    sys_ll_set_ana_reg28_micen_mic3(value);
}
void sys_hal_aud_mic3_rst_set(uint32_t value)
{
    sys_ll_set_ana_reg28_rst_mic3(value);
}
void sys_hal_aud_mic3_gain_set(uint32_t value)
{
    sys_ll_set_ana_reg28_micgain_mic3(value);
}
void sys_hal_aud_mic3_single_en(uint32_t value)
{
    sys_ll_set_ana_reg28_micsingleen_mic3(value);
}

/**  Audio End  **/
/**  FFT Start  **/
void sys_hal_fft_disckg_set(uint32_t value)
{
	return;
}
void sys_hal_cpu_fft_int_en(uint32_t value)
{
	return;
}
/**  FFT End  **/
/**  I2S Start  **/
void sys_hal_i2s_select_clock(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s0(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s1(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s2(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s3(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s4(value);
}
void sys_hal_i2s_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s0_cken(value);
}
void sys_hal_i2s1_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s1_cken(value);
}
void sys_hal_i2s2_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s2_cken(value);
}
void sys_hal_i2s3_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s3_cken(value);
}
void sys_hal_i2s4_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s4_cken(value);
}

void sys_hal_i2s_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s0_int_en(value);
}
void sys_hal_i2s1_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s1_int_en(value);
}
void sys_hal_i2s2_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_i2s2_int_en(value);
}
void sys_hal_i2s3_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_i2s3_int_en(value);
}
void sys_hal_i2s4_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_64_95_en_cpu0_i2s4_int_en(value);
}

void sys_hal_i2s_disckg_set(uint32_t value)
{
	return;
}
void sys_hal_apll_en(uint32_t value)  /// modify - 260105
{
	if(value == 0)
	{
		sys_ll_set_ana_reg5_pwdaudpll(1);
	}
	else
	{
		sys_ll_set_ana_reg5_pwdaudpll(0);
	}
    //sys_ll_set_ana_reg5_pwdaudpll(value);
}
void sys_hal_cb_manu_val_set(uint32_t value)
{
	return;
}
void sys_hal_ana_reg11_vsel_set(uint32_t value)
{
	return;
}
void sys_hal_apll_cal_val_set(uint32_t value)  /// modify - 260105
{
    //sys_ll_set_ana_reg26_value(value);
    sys_ll_set_ana_reg26_n(value);
	sys_ll_set_ana_reg26_calres_spien(0);
	sys_ll_set_ana_reg26_calrefen(1);
}
void sys_hal_apll_spi_trigger_set(uint32_t value)
{
    sys_ll_set_ana_reg25_spi_trigger(value);
}
void sys_hal_i2s0_ckdiv_set(uint32_t value)
{
	return;
}
void sys_hal_apll_config_set(uint32_t value)
{
	sys_ll_set_ana_reg25_value(value);///
	return;
}
/**  I2S End  **/
/**  Touch Start **/
void sys_hal_touch_power_down(uint32_t value)
{
	return;
}
void sys_hal_touch_sensitivity_level_set(uint32_t value)
{
	return;
}
void sys_hal_touch_scan_mode_enable(uint32_t value)
{
	return;
}
void sys_hal_touch_detect_threshold_set(uint32_t value)
{
	return;
}
void sys_hal_touch_detect_range_set(uint32_t value)
{
	return;
}
void sys_hal_touch_calib_enable(uint32_t value)
{
	return;
}
void sys_hal_touch_cal_ctrl_set(uint32_t value)
{
	return;
}
uint32_t sys_hal_touch_cal_ctrl_get(void)
{
	return 0;
}
void sys_hal_touch_cal_vth_set(uint32_t value)
{
	return;
}
uint32_t sys_hal_touch_cal_vth_get(void)
{
	return 0;
}
void sys_hal_touch_rstb_dig_set(uint32_t value) { return; }
uint32_t sys_hal_touch_rstb_dig_get(void) { return 0; }
void sys_hal_touch_ldoen_set(uint32_t value) { return; }
uint32_t sys_hal_touch_ldoen_get(void) { return 0; }
void sys_hal_touch_cal_auto_set(uint32_t value) { return; }
void sys_hal_touch_cal_done_clr(uint32_t value) { return; }
void sys_hal_touch_manul_mode_calib_value_set(uint32_t value)
{
	return;
}
uint32_t sys_hal_touch_calib_value_get(void)
{
	return 0;
}
void sys_hal_touch_manul_mode_enable(uint32_t value)
{
	return;
}
void sys_hal_touch_scan_mode_chann_set(uint32_t value)
{
	return;
}
void sys_hal_touch_scan_mode_chann_sel(uint32_t value)
{
	return;
}
void sys_hal_touch_serial_cap_enable(void)
{
	return;
}
void sys_hal_touch_serial_cap_disable(void)
{
	return;
}
void sys_hal_touch_serial_cap_sel(uint32_t value)
{
	return;
}
void sys_hal_touch_spi_lock(void)
{
	return;
}
void sys_hal_touch_spi_unlock(void)
{
	return;
}
void sys_hal_touch_test_period_set(uint32_t value)
{
	return;
}
void sys_hal_touch_test_number_set(uint32_t value)
{
	return;
}
void sys_hal_touch_calib_period_set(uint32_t value)
{
	return;
}
void sys_hal_touch_calib_number_set(uint32_t value)
{
	return;
}
void sys_hal_touch_int_set(uint32_t value)
{
	return;
}
void sys_hal_touch_int_clear(uint32_t value)
{
	return;
}
void sys_hal_touch_int_enable(uint32_t value)
{
	return;
}
/**  Touch End **/
/** jpeg start **/
void sys_hal_set_jpeg_clk_sel(uint32_t value)
{
	return;
}
void sys_hal_set_clk_div_mode1_clkdiv_jpeg(uint32_t value)
{
	return;
}
void sys_hal_set_jpeg_disckg(uint32_t value)
{
	return;
}
void sys_hal_set_cpu_clk_div_mode1_clkdiv_bus(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_ckdiv_auxs(value);
}
void sys_hal_video_power_en(uint32_t value)
{
	return;
}
void sys_hal_set_auxs_cis_clk_sel(uint32_t value)
{
	return;
}
void sys_hal_set_auxs_cis_clk_div(uint32_t value)
{
	return;
}
void sys_hal_set_jpeg_clk_en(uint32_t value)
{
	return;
}
void sys_hal_set_cis_auxs_clk_en(uint32_t value)
{
	return;
}
/** jpeg end **/
/** h264 Start **/
void sys_hal_set_h264_clk_en(uint32_t value)
{
	return;
}
/** h264 End **/
/**  psram Start **/
void sys_hal_psram_volstage_sel(uint32_t enable)
{
	return;
}
void sys_hal_psram_xtall_osc_enable(uint32_t enable)
{
	return;
}
void sys_hal_psram_doc_enable(uint32_t enable)
{
	return;
}
void sys_hal_psram_ldo_enable(uint32_t enable)
{
	return;
}
void sys_hal_psram_dpll_enable(uint32_t enable)
{
	return;
}
void sys_hal_psram_clk_sel(uint32_t value)
{
	return;
}
void sys_hal_psram_set_clkdiv(uint32_t value)
{
	return;
}
void sys_hal_psram_psldo_vsel(uint32_t value)
{
	return;
}
void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	return;
}
void sys_hal_psram_psram_disckg(uint32_t value)
{
	return;
}

