bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
uint32_t sys_hal_get_psram_interleave_config(void)
{
#if (CONFIG_PSRAM_INTERLEAVE)
	return sys_ahbp_ll_get_reg7_psram_inv_config();
#else
	return 0;
#endif
}

/**  psram End **/
/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
	return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}
void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
	sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}
__IRAM_SEC void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
	return;
}
/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
	return;
}

void sys_hal_set_eth_clk_en(uint32_t value)
{
	sys_aonp_regd_t *r = (sys_aonp_regd_t *)(SOC_SYS_AONP_REG_BASE + (0xd << 2));
	r->auxs_enet_cken = value;
}
#endif
/** Ethernet End**/
void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
	return;
}
void sys_hal_set_ana_scal_en(uint32_t value)
{
	return;
}
void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_bufamp_isel(value);
}

void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_comp_isel(value);
}

void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_inbuf_en(!value);
}

void sys_hal_set_ana_vref_sel(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_vref_sel(value);
}
void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg5_pwd_rosc_spi(uint32_t value)
{
	sys_ll_set_ana_reg5_pwd_rosc_spi(value);
}
void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
	return;
}
void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
	sys_ll_set_ana_reg10_vdiglsel(value);
}

void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
	sys_ll_set_ana_reg10_vdighsel(value);
}
void sys_hal_set_sdio_clk_en(uint32_t value)
{
	return;
}
void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	return;
}
void sys_hal_set_cpu1_sdio_int_en(uint32_t value)
{
	return;
}
void sys_hal_set_cpu2_sdio_int_en(uint32_t value)
{
	return;
}
void sys_hal_set_sdio_clk_div(uint32_t value)
{
	return;
}
uint32_t sys_hal_get_sdio_clk_div()
{
	return 0;
}
void sys_hal_set_sdio_clk_sel(uint32_t value)
{
	return;
}
uint32_t sys_hal_get_sdio_clk_sel()
{
	return 0;
}
void sys_hal_set_ana_vctrl_sysldo(uint32_t value)
{
	sys_ll_set_ana_reg2_vctrl_vsel(value);
}
void sys_hal_set_yuv_buf_clock_en(uint32_t value)
{
	return;
}
void sys_hal_set_h264_clock_en(uint32_t value)
{
	return;
}
void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	return;
}
__IRAM_SEC uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return 0;
}
void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg11_apfms(uint32_t value)
{
	sys_ll_set_ana_reg12_apfms(value);
}

void sys_hal_set_ana_reg12_dpfms(uint32_t value)
{
	sys_ll_set_ana_reg13_dpfms(value);
}
static void sys_hal_delay(volatile uint32_t times)
{
	while (times--);
}
uint32_t sys_hal_cali_dpll(uint32_t param)
{
	return 0;
}

static void sys_hal_dpll_cpu_flash_time_early_init(uint32_t chip_id)
{
	sys_ll_set_reserver_reg0xd_sig_240m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_320m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_480m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_160m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_120m_cken(1);

	sys_ll_set_cpu_clk_div_mode1_ckdiv_core(0x3);
	sys_ll_set_cpu_clk_div_mode1_cksel_core(0x3);
	return;
}

static void sys_hal_pwd_rosc()
{
	return;
}
void sys_hal_early_init(void)
{
	return;
}
void sys_hal_set_7816_int_en(uint32_t core_index, uint32_t value)
{
	return;
}
void sys_hal_set_scr_clk(uint32_t value)
{
	return;
}
void sys_hal_set_cpu0_rxevt_sel(uint32_t param)
{
	sys_ll_set_cpu0_int_halt_clk_op_cpu0_rxevt_sel(param);
}
void sys_hal_set_cpu1_rxevt_sel(uint32_t param)
{
	sys_ll_set_cpu1_int_halt_clk_op_cpu1_rxevt_sel(param);
}
void sys_hal_set_cpu2_rxevt_sel(uint32_t param)
{
	// CPU2 (M55 sub-core) does not support rxevt_sel control in sys_ahbp_reg4
	// This register field is not available in sys_ahbp_reg4_t structure
	(void)param;
}
void sys_hal_set_cpu_device_clk_enable_otp_cken(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_otp_cken(value);
}
void sys_hal_set_cpu_power_sleep_wakeup_ticktimer_32k_enable(uint32_t value)
{
	sys_ll_set_cpu_power_sleep_wakeup_cpu0_ticktimer_32k_enable(value);
	sys_ll_set_cpu_power_sleep_wakeup_cpu1_ticktimer_32k_enable(value);
}

bk_err_t sys_hal_cpu_freq_dump()
{
	enum {
		AP_CLKSEL_CORE_160M = 0,
		AP_CLKSEL_CORE_480M,
		AP_CLKSEL_CORE_640M,
		AP_CLKSEL_CORE_DCO,
	};
	uint32_t value_8;
	uint32_t cksel_core;
	uint32_t ap_div;

	value_8 = REG_READ(SOC_SYS_AHBP_REG_BASE + (0x8 << 2));
	cksel_core = value_8 & 0x3;
	ap_div = ((value_8 >> 2) & 0x3) + 1;

	switch (cksel_core) {
	case AP_CLKSEL_CORE_160M:
		os_printf("Cur freq: AP:(160/%d)M,VDDDIG:%fV\r\n", ap_div,
			PM_AP_VDDDIG_REG_VALUE_TO_VOLT(sys_ll_get_ana_reg16_vcorehssel()));
		break;
	case AP_CLKSEL_CORE_480M:
		os_printf("Cur freq: AP:(480/%d)M,VDDDIG:%fV\r\n", ap_div,
			PM_AP_VDDDIG_REG_VALUE_TO_VOLT(sys_ll_get_ana_reg16_vcorehssel()));
		break;
	case AP_CLKSEL_CORE_640M:
		os_printf("Cur freq: AP:(640/%d)M,VDDDIG:%fV\r\n", ap_div,
			PM_AP_VDDDIG_REG_VALUE_TO_VOLT(sys_ll_get_ana_reg16_vcorehssel()));
		break;
	case AP_CLKSEL_CORE_DCO:
		os_printf("Cur freq: AP:(240/%d)M,VDDDIG:%fV\r\n", ap_div,
			PM_AP_VDDDIG_REG_VALUE_TO_VOLT(sys_ll_get_ana_reg16_vcorehssel()));
		break;
	default:
		break;
	}
	os_printf("AP_Freq_reg:0x%x\r\n", value_8);
	os_printf("AP power: VIDEO_POST:%s, H26E:%s, ISP:%s, NPU:%s\r\n",
		sys_ahbp_ll_get_rege_pwd_video_post() ? "OFF" : "ON",
		sys_ahbp_ll_get_rege_pwd_h26e() ? "OFF" : "ON",
		sys_ahbp_ll_get_rege_pwd_isp() ? "OFF" : "ON",
		sys_ahbp_ll_get_rege_pwd_npu() ? "OFF" : "ON");

	return BK_OK;
}


/** gpu Start **/
void sys_hal_set_gpu_buffa_enable_value(uint32_t value)
{
    sys_ahbp_ll_set_reg28_gpu_buffa_enable(value);
}

uint32_t sys_hal_get_gpu_buffa_enable_value(void)
{
    return sys_ahbp_ll_get_reg28_gpu_buffa_enable();
}

void sys_hal_set_gpu_buffa_begin_value(uint32_t value)
{
    sys_ahbp_ll_set_reg29_value(value);
}

uint32_t sys_hal_get_gpu_buffa_begin_value(void)
{
    return sys_ahbp_ll_get_reg29_value();
}

void sys_hal_set_gpu_buffa_size_value(uint32_t value)
{
    sys_ahbp_ll_set_reg2a_value(value);
}

uint32_t sys_hal_get_gpu_buffa_size_value(void)
{
    return sys_ahbp_ll_get_reg2a_value();
}

void sys_hal_set_gpu_pica_begin_value(uint32_t value)
{
    sys_ahbp_ll_set_reg2b_value(value);
}

uint32_t sys_hal_get_gpu_pica_begin_value(void)
{
    return sys_ahbp_ll_get_reg2b_value();
}

