bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/hal/sys_hal.c
void sys_hal_set_gpu_pica_halfbuff_end_value(uint32_t value)
{
    sys_ahbp_ll_set_reg2c_value(value);
}

uint32_t sys_hal_get_gpu_pica_halfbuff_end_value(void)
{
    return sys_ahbp_ll_get_reg2c_value();
}

void sys_hal_set_gpu_pica_end_value(uint32_t value)
{
    sys_ahbp_ll_set_reg2d_value(value);
}

uint32_t sys_hal_get_gpu_pica_end_value(void)
{
    return sys_ahbp_ll_get_reg2d_value();
}

void sys_hal_set_gpu_buffa_remap_addr_value(uint32_t value)
{
    sys_ahbp_ll_set_reg2f_value(value);
}

uint32_t sys_hal_get_gpu_buffa_remap_addr_value(void)
{
    return sys_ahbp_ll_get_reg2f_value();
}

void sys_hal_set_gpu_buffb_enable_value(uint32_t value)
{
    sys_ahbp_ll_set_reg30_value(value);
}

uint32_t sys_hal_get_gpu_buffb_enable_value(void)
{
    return sys_ahbp_ll_get_reg30_value();
}

void sys_hal_set_gpu_buffb_begin_value(uint32_t value)
{
    sys_ahbp_ll_set_reg31_value(value);
}

uint32_t sys_hal_get_gpu_buffb_begin_value(void)
{
    return sys_ahbp_ll_get_reg31_value();
}

void sys_hal_set_gpu_buffb_size_value(uint32_t value)
{
    sys_ahbp_ll_set_reg32_value(value);
}

uint32_t sys_hal_get_gpu_buffb_size_value(void)
{
    return sys_ahbp_ll_get_reg32_value();
}

void sys_hal_set_gpu_picb_begin_value(uint32_t value)
{
    sys_ahbp_ll_set_reg33_value(value);
}

uint32_t sys_hal_get_gpu_picb_begin_value(void)
{
    return sys_ahbp_ll_get_reg33_value();
}

void sys_hal_set_gpu_picb_halfbuff_end_value(uint32_t value)
{
    sys_ahbp_ll_set_reg34_value(value);
}

uint32_t sys_hal_get_gpu_picb_halfbuff_end_value(void)
{
    return sys_ahbp_ll_get_reg34_value();
}

void sys_hal_set_gpu_picb_end_value(uint32_t value)
{
    sys_ahbp_ll_set_reg35_value(value);
}

uint32_t sys_hal_get_gpu_picb_end_value(void)
{
    return sys_ahbp_ll_get_reg35_value();
}

void sys_hal_set_gpu_buffb_remap_addr_value(uint32_t value)
{
    sys_ahbp_ll_set_reg37_value(value);
}

uint32_t sys_hal_get_gpu_buffb_remap_addr_value(void)
{
    return sys_ahbp_ll_get_reg37_value();
}
/** gpu End **/

/** reg20 - AHB Peripheral Bus Master QoS Control **/

void sys_hal_set_psram_qos_value(uint32_t v)
{
	sys_ahbp_ll_set_reg20_value(v);
}

uint32_t sys_hal_get_psram_qos_value(void)
{
	return sys_ahbp_ll_get_reg20_value();
}

void sys_hal_set_psram_cpu0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_cpu0_qos(v);
}

uint32_t sys_hal_get_psram_cpu0_qos(void)
{
	return sys_ahbp_ll_get_reg20_cpu0_qos();
}

void sys_hal_set_psram_dma1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_dma1_qos(v);
}

uint32_t sys_hal_get_psram_dma1_qos(void)
{
	return sys_ahbp_ll_get_reg20_dma1_qos();
}

void sys_hal_set_psram_sdio0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_sdio0_qos(v);
}

uint32_t sys_hal_get_psram_sdio0_qos(void)
{
	return sys_ahbp_ll_get_reg20_sdio0_qos();
}

void sys_hal_set_psram_sdio1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_sdio1_qos(v);
}

uint32_t sys_hal_get_psram_sdio1_qos(void)
{
	return sys_ahbp_ll_get_reg20_sdio1_qos();
}

/* NOTE: enet0 QoS is marked as INVALID in hardware spec. Do NOT use. */
void sys_hal_set_psram_enet0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_enet0_qos(v);
}

uint32_t sys_hal_get_psram_enet0_qos(void)
{
	return sys_ahbp_ll_get_reg20_enet0_qos();
}

/* NOTE: enet1 QoS is marked as INVALID in hardware spec. Do NOT use. */
void sys_hal_set_psram_enet1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_enet1_qos(v);
}

uint32_t sys_hal_get_psram_enet1_qos(void)
{
	return sys_ahbp_ll_get_reg20_enet1_qos();
}

void sys_hal_set_psram_usb_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_usb_qos(v);
}

uint32_t sys_hal_get_psram_usb_qos(void)
{
	return sys_ahbp_ll_get_reg20_usb_qos();
}

void sys_hal_set_psram_h26e_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_h26e_qos(v);
}

uint32_t sys_hal_get_psram_h26e_qos(void)
{
	return sys_ahbp_ll_get_reg20_h26e_qos();
}

void sys_hal_set_psram_isp_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_isp_qos(v);
}

uint32_t sys_hal_get_psram_isp_qos(void)
{
	return sys_ahbp_ll_get_reg20_isp_qos();
}

void sys_hal_set_psram_videopost_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_videopost_qos(v);
}

uint32_t sys_hal_get_psram_videopost_qos(void)
{
	return sys_ahbp_ll_get_reg20_videopost_qos();
}

void sys_hal_set_psram_dpu_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_dpu_qos(v);
}

uint32_t sys_hal_get_psram_dpu_qos(void)
{
	return sys_ahbp_ll_get_reg20_dpu_qos();
}

void sys_hal_set_psram_cbus_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_cbus_qos(v);
}

uint32_t sys_hal_get_psram_cbus_qos(void)
{
	return sys_ahbp_ll_get_reg20_cbus_qos();
}

void sys_hal_set_psram_npu0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_npu0_qos(v);
}

uint32_t sys_hal_get_psram_npu0_qos(void)
{
	return sys_ahbp_ll_get_reg20_npu0_qos();
}

void sys_hal_set_psram_npu1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_npu1_qos(v);
}

uint32_t sys_hal_get_psram_npu1_qos(void)
{
	return sys_ahbp_ll_get_reg20_npu1_qos();
}

void sys_hal_set_psram_cpu1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_cpu1_qos(v);
}

uint32_t sys_hal_get_psram_cpu1_qos(void)
{
	return sys_ahbp_ll_get_reg20_cpu1_qos();
}

/** RISC-V Interrupt Configuration **/
void sys_hal_set_ints_config_riscv_0_31(uint32_t v)
{
	sys_ahbp_ll_set_reg16_ints_config_scr1_0(v);
}

uint32_t sys_hal_get_ints_config_riscv_0_31(void)
{
	return sys_ahbp_ll_get_reg16_ints_config_scr1_0();
}

void sys_hal_set_ints_config_riscv_32_63(uint32_t v)
{
	sys_ahbp_ll_set_reg17_ints_config_scr1_1(v);
}

uint32_t sys_hal_get_ints_config_riscv_32_63(void)
{
	return sys_ahbp_ll_get_reg17_ints_config_scr1_1();
}